<a href="https://colab.research.google.com/github/Igetsuga/cs/blob/master/practice1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [34]:
%load_ext sql
%sql sqlite://

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @None'

In [53]:
%%sql 

PRAGMA foreign_keys = ON;

drop table if exists Students;
drop table if exists Program;

 * sqlite://
Done.
Done.
Done.

[]

In [54]:
%%sql 

drop table if exists Program;
CREATE TABLE Program
(
    program_id integer primary key, 
    program_name varchar(50)
);

insert Into program(program_id, program_name) values (1, 'Bio');
insert Into program(program_id, program_name) values (2, 'Computer security');
insert Into program(program_id, program_name) values (3, 'PMI');
insert Into program(program_id, program_name) values (4, 'Robotics');
insert Into program(program_id, program_name) values (5, 'System analysis');
insert Into program(program_id, program_name) values (6, 'Data security');
insert Into program(program_id, program_name) values (7, 'Managment');

select * from program;

 * sqlite://
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Bio'),
 (2, 'Computer security'),
 (3, 'PMI'),
 (4, 'Robotics'),
 (5, 'System analysis'),
 (6, 'Data security'),
 (7, 'Managment')]

In [55]:
%%sql

drop table if exists Students;

CREATE TABLE Students 
(
    student_id integer primary key, 
    student_name varchar(50),
    student_sname varchar(50),
    student_program_id integer,
    class varchar(20),
    GPA number,
    foreign key(student_program_id) references program(program_id)
);

insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (1, 'Альянов', 'Николай', 1, '04-20', 3.58);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (2, 'Крыгина', 'Ева', 1, '01-20', 4.58);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (3, 'Исаева', 'Анна', 1, '01-20', 4.75);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (4, 'Егоров', 'Павел', 2, '01-20', 4.83);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (5, 'Тихомиров', 'Тимофей', 2, '03-20', 4.18);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (6, 'Ширшов', 'Александр', 2, '06-20', 3.91);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (7, 'Фатеев', 'Максим', 3, '05-20', 3.8);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (8, 'Киселев', 'Петр',  3, '05-20', 3.5);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (9, 'Агашкина', 'Дарья', 4, '02-20', 4.18);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (10, 'Горин', 'Олег', 5, '01-20', 3.89);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (11, 'Комарова', 'Виктория', 6, '02-20', 4.83);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (12, 'Челыхов', 'Иван', 6, '06-20', 4.45);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (13, 'Назаров', 'Александр', 6, '06-20', 3.73);
insert into Students(student_id, student_sname, student_name, student_program_id, class, GPA) VALUES (14, 'Горлова', 'Ксения', 7, '01-20', 5);

select * from Students;

 * sqlite://
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
Done.

[(1, 'Николай', 'Альянов', 1, '04-20', 3.58),
 (2, 'Ева', 'Крыгина', 1, '01-20', 4.58),
 (3, 'Анна', 'Исаева', 1, '01-20', 4.75),
 (4, 'Павел', 'Егоров', 2, '01-20', 4.83),
 (5, 'Тимофей', 'Тихомиров', 2, '03-20', 4.18),
 (6, 'Александр', 'Ширшов', 2, '06-20', 3.91),
 (7, 'Максим', 'Фатеев', 3, '05-20', 3.8),
 (8, 'Петр', 'Киселев', 3, '05-20', 3.5),
 (9, 'Дарья', 'Агашкина', 4, '02-20', 4.18),
 (10, 'Олег', 'Горин', 5, '01-20', 3.89),
 (11, 'Виктория', 'Комарова', 6, '02-20', 4.83),
 (12, 'Иван', 'Челыхов', 6, '06-20', 4.45),
 (13, 'Александр', 'Назаров', 6, '06-20', 3.73),
 (14, 'Ксения', 'Горлова', 7, '01-20', 5)]

### Задание 1

In [56]:
%%sql

select student_sname
  from students
    where (student_name == "Александр")

 * sqlite://
Done.

[('Ширшов',), ('Назаров',)]

### Задание 2

In [33]:
%%sql

select DISTINCT program_name
  from students, program
    where (student_program_id = program_id) and (GPA >= 4)

 * sqlite://
Done.

[('Bio',),
 ('Computer security',),
 ('Robotics',),
 ('Data security',),
 ('Managment',)]

### Задание 3

In [57]:
%%sql


select student_name, student_sname
  from students
    -- where (student_sname LIKE "К%" OR student_sname LIKE "%к%") and (student_name LIKE "%е%");
    where (student_sname LIKE "К%") and (student_name LIKE "%е%");

 * sqlite://
Done.

[('Петр', 'Киселев')]

### Задание 4

In [61]:
%%sql 


select program_name, AVG(GPA)
  from program, students
    where (student_program_id = program_id) 
    GROUP BY student_program_id 
      HAVING count(DISTINCT class) > 1

 * sqlite://
Done.

[('Bio', 4.303333333333334),
 ('Computer security', 4.306666666666667),
 ('Data security', 4.336666666666667)]

### Задание 5

In [64]:
%%sql


select program_name, AVG(GPA)
  from program, 
       (select * 
          from students
            where student_sname NOT LIKE "_а%") newStudents
    where (newStudents.student_program_id = program_id)
    GROUP BY newStudents.student_program_id 
      HAVING count(newStudents.student_id) >= 2

 * sqlite://
Done.

[('Bio', 4.303333333333334),
 ('Computer security', 4.306666666666667),
 ('Data security', 4.640000000000001)]